package com.hawx.uestc_lib.data;

import android.util.Log;

import com.hawx.uestc_lib.R;

import java.util.ArrayList;

/**
 * Created by Administrator on 2016/5/27.
 */

public class RecommendTestData {
    public static String[] bookNames = new String[]{"微观历史", "梦里花落知多少", "明朝那些事儿", "许三观卖血记",
            "京华烟云", "倾城之恋", "我们仨", "根鸟", "城南旧事"};
    public static int[] bookPicResource = new int[]{R.drawable.test_1, R.drawable.test_2, R.drawable.test_3,
            R.drawable.test_4, R.drawable.test_5, R.drawable.test_6, R.drawable.test_7, R.drawable.test_8,
            R.drawable.test_9};
    private static String[] tags=new String[]{"一本好书 中国历史 历史好书推荐 历史日记 当代中国 ","中国文学经典 好书 好书推荐 爱情 经典散文推荐 ",
            "中国历史 历史小说 好书推荐 明朝 畅销书排行榜 ","中国当代文学 中国文学名著 人生 民间小说 经典好书推荐 ","中国文学名著 中国近代历史 值得看的好书 小说推荐 经典好书推荐 ",
            "中国文学经典 好书推荐 爱情 经典爱情小说 ","关于亲情的书籍 好书推荐排行榜 家庭生活回忆录 经典散文推荐 ",
            "儿童文学奖 成长小说 推荐好书 经典儿童文学 ","中国儿童文学经典 好书推荐 成长小说 自传体小说 "};
    private static String[] reading=new String[]{"2737人阅读","6662人阅读","5841人阅读","5350人阅读","3754人阅读","4913人阅读","3916人阅读","2012人阅读","3568人阅读"};
    private static String[] brief=new String[]{"《微观历史》是中国作家祝伟坡著作的一部历史笔记。作品从个人视角出发，记录了1957年至1965年期间中国大跃进人民公社化运动、整风整社运动、四清运动等建国初期的历史事件。《微观历史》以震撼人心的坦率直播个人命运的进退，用亲身经历的事实投影社会历史的浮沉，堪称一部微观的共和国史。\n《微观历史》作者祝伟坡于1935年出生在河北省魏县，是河北师范大学副教授、中国历史学者。他早年曾研究外国文学，后主要研究中国近现代史，经常在多处报刊发表学术论文和散文，文学代表作有《踏步集》、《微观历史》等。\n新中国建国初期，那是一段怎样的岁月呢？小时候，爷爷奶奶偶尔会给我们讲那个时代的故事；历史课本上，我们也能了解个大概。但是，那段岁月始终如一个蒙着面纱的女子，朦朦胧胧的，瞧不见她的真容。而《微观历史》，却帮助我们轻轻撩起了那层神秘的面纱，再现了那个时期真实的社会风貌。\n《微观历史》以日记的形式，记录了历次运动中的所见所闻、所思所感，带领我们走进那段不平凡的岁月，让我们重温历史，体会当时人们迷茫的心理和曲折坎坷的人生，感受时代脉搏的跳动。这些字字真诚的日记于细微处见证了一个时代的理想、迷失和荒诞，它既是火热年代平民的心灵史，更是时代的活化石。《微观历史》中大量珍贵的历史照片，让我们直击历史场景，让那段岁月的故事如电影般播放在我们的眼前，清清楚楚。\n翻开《微观历史》，阅读珍藏的日记，让我们体味到一个青年的心灵独白。拂去历史的尘埃，《微观历史》再现了一个国家的时代风貌。著名学者单正平说：“这是一个普通知识分子的心路历程。一切都似曾相识，一切都陌生新鲜，一切都惊心动魄，一切都微波细澜。家史即国史，心史即信史。大一统下的破碎人生，最宜用日记也只有用日记做记录。时过境未迁，后生堪镜鉴。”\n《微观历史》真实地为读者们展现了那段不平凡年代的历史，对于年轻一代正确地总结过去、珍惜今天，有着十分积极的意义。\n《微观历史》",
            "“记得当时年纪小，你爱谈天我爱笑。有一回并肩坐在桃树下，风在树梢鸟在叫。不知怎么睡着了，梦里花落知多少。” 或许大家很熟悉青年作家郭敬明的青春小说《梦里花落知多少》，那么，不知道大家对流浪女作家三毛的著名散文集《梦里花落知多少》了解多少呢？《梦里花落知多少》是中国当代著名作家三毛在丈夫荷西去世后于万分悲痛中创作的散文集，书中的每一字，每一句，都饱含着她对丈夫荷西深深的思念之情……\n《梦里花落知多少》一书中共有23篇文章，记录了三毛在丈夫荷西意外过世后的生活。丈夫荷西的死对三毛来说是一场劫难。与写《撒哈拉的故事》的时候相比，三毛在文学和心情上都与早期大不相同。《撒哈拉的故事》中的文章精彩动人，以清新自然的文笔将单调却有趣的沙漠生活娓娓道来。那时的三毛天真烂漫，那时的荷西阳光痴情，那时的他们俩，就是两个还没长大的孩子。而《梦里花落知多少》中的文章总带着点点哀愁与黯然，说情叙事极其内敛，笔调哀而不伤，一字一句皆诉说着三毛对丈夫荷西的深深的思恋，表达着三毛对人生、对爱情的坚定。\n三毛原名陈懋平，后改为陈平。说起三毛，不禁想起张爱玲。张爱玲从骨子里透出冷意，而三毛的骨子里却是热的，而且三毛骨子里带有流浪的天性，旅行与读书是她人生中的两大爱好，她的足迹遍布世界各地。但她说，流浪一点都不浪漫。对于她来说，流浪是被迫的。可是在她的笔下，我们却从没看到过她的抱怨，因为她总能发掘生活中有趣的一面，这是三毛最可贵的品质。\n荷西曾对三毛说过：“你不死，我不死……要到你很老我也很老，两个人都走不动也扶不动了，穿上干干净净的衣服，一齐躺在床上，闭上眼睛说：好吧，一齐去吧！” 而有人也曾经问三毛：“如果在这世上再有一个很爱你的人，指的是婚姻关系，你会不会答应？”三毛答道：“我有一个很爱的人在我心里，叫荷西。这问题不能说，不可说，不知道。我想百分之九十九点九是不，因为我已经有了。” 可见，三毛和荷西，虽然只有短短六年的相爱相守，可他们之间的感情，是刻骨铭心的……\n翻开三毛的《梦里花落知多少》，让我们静静地品读三毛，品读荷西，品读他和她的爱情、他和她的生活，品读荷西对三毛的痴情，品读三毛对荷西的思恋……\n《梦里花落知多少》",
            "《明朝那些事儿》是中国青年历史学者当时明月创作的一系列连载的历史小说，作品讲述了从1344年到1644年间中国明朝三百年的历史故事。小说以史料为基础，以年代和具体人物为主线，以小说的笔法，从朱元璋出生开始讲起，到崇祯皇帝自缢、明朝灭亡结束，将明朝十七帝、王公权贵和小人物的命运等娓娓道来，进行了全景式的展示与描写。而作品对官场政治、战争、帝王心术等的描写更为突出，着墨更多，也对当时的政治经济制度和人伦道德进行了演绎。《明朝那些事儿》精彩绝伦，引人入胜，掀起了一股明朝热。\n《明朝那些事儿》的作者当年明月，原名石悦，男，于1979年出生在宜昌一个普通的干部家庭里，曾是广东顺德海关的一名公务员，现为中国海关总署缉私警察。他于2006年3月在天涯社区首次发表《明朝那些事儿》，于2009年3月21日连载完毕，现已全部集结成书出版发行，一共7部。当年明月是青年历史学者、畅销书作家，也是明史学会会员，更是心灵历史的开创者。他的代表作《明朝那些事儿》销量已过五百万册，为三十年来最畅销的史学读本。\n《明朝那些事儿》共有七部，第一部从朱元璋的出身开始写起，到永乐大帝夺位的靖难之役结束为止，叙述了明朝最艰苦卓绝的开国过程和永乐夺位、建文失踪的靖难之役……第七部描写了明朝最后一位皇帝崇祯的故事和北方后金势力的崛起。七部历史小说，精彩的演绎了中国明代三百年的历史故事和重要历史人物，吸引了千千万万的读者。\n《明朝那些事儿》是迄今为止唯一全本白话正说明朝大历史。作者当时明月以通俗浅显甚至娱乐化的手法重述、重写历史，引发了一场“感染”者高烧不退的“读史热”。而因这一系列作品的持续畅销，当时明月连续五年荣登“中国作家富豪榜”，成为近几年国内文化界的一大奇观，也引起了不少争议。\n《明朝那些事儿》是一部“好读”的历史，也是一部“老百姓”可以读的历史，能够让大家阅读得畅快淋漓。让我们翻开《明朝那些事儿》，走进中国明朝，去细细体会那些事儿……\n《明朝那些事儿》",
            "《许三观卖血记》是中国当代著名作家余华于1995年创作的一部长篇小说。作品以博大的温情描绘了磨难中的人生，以激烈的故事形式表达了人在面对厄运时求生的欲望。小说中的人生充满了苦难和痛苦，却渗透了一种契诃夫式的悲悯情绪，令读者一唱三叹、回味无穷。\n《许三观卖血记》是一部精妙绝伦的小说，是朴实简洁和内涵意蕴深远的完美结合。作者余华，于1960年出生在浙江杭州，后迁居浙江海盐，现定居浙江杭州。在其青春成长期间，学习了一回鲁迅先生，弃医从文。从文后先后发表了很多作品，被翻译为多种文字，畅销国内外，对社会的影响颇深，因此也获得了许许多多的奖项，享誉中外。其文学代表作有《活着》、《许三观卖血记》、《在细雨中呼喊》、《兄弟》等等。\n《许三观卖血记》一书中的故事发生在中国解放初的五六十年代，主人公许三观是一个有着好奇心和责任心的青年，为了生活，他拼命工作，但依然无法保证生活。于是，他就去卖血，靠着卖血，他渡过了人生的一个个难关，也一次次战胜了命运强加给他的惊涛骇浪。后来，他老了，无法卖血了，他坐着哭了，感觉人生走到了尽头……\n在这部感人肺腑的小说里，没有绚烂的情节，有的只是一个简单的民间故事：一个中国家庭忍受贫穷、饥荒以及随后的文化大革命……虽然小说充满了辛酸，却也不乏幽默之处，这充分展现了余华令人惊悚而滑稽的写作风格。\n作者余华说：“这本书其实是一首很长的民歌，它的节奏是回忆的速度，旋律温和地跳跃着，休止符被韵脚隐藏了起来。” 让我们轻轻吟唱起这首民歌，走进这部颇具形式美感的文学作品，去体会中国近代贫苦老百姓们的苦难人生……\n《许三观卖血记》",
            "《京华烟云》是华语文坛最幽默睿智的一支笔、一代国学大师林语堂先生最负盛名的传世之作，是一部全景式展现中国风云变幻的人文、社会和文化的史诗巨著，更有现代版“红楼梦”的美称。作品讲述了北平曾、姚、牛三大家族从1901年义和团运动到抗日战争30多年间的命运浮沉、悲欢离合和恩怨情仇，曾获得诺贝尔文学奖提名，是一部关于现代中国社会现实的经典小说。\n《京华烟云》是国学大师林语堂先生旅居法国巴黎时于1938年8月至1939年8月间用英文创作的长篇小说，原书名为《Moment in Peking》。林语堂先生是中国现代著名的学者、语言学家、文学家和哲学家，他的著名代表作有《京华烟云》、《风声鹤唳》、《吾国与吾民》、《人生不过如此》、《生活的艺术》和《人生的盛宴》等。林语堂先生一生著作等身，享誉中外，在世界文坛上拥有重要的地位。\n《京华烟云》是献给“英勇的中国士兵”的一部伟大著作。小说仿照《红楼梦》的结构，以真挚饱满的情感、严肃而又幽默的文笔，讲述了北平曾、姚、牛三大家族30年间的历史变迁，写出了袁世凯篡国、张勋复辟、直奉大战、军阀割据、“五四”运动、“三·一八”惨案、青年“左倾”、二战爆发等近半个世纪的中国历史事件，全面地展现了现代中国真实的社会状况，吸引了一代又一代爱好历史的读者们。\n《京华烟云》一书集佳话、哲学、历史演义、风俗变迁、深谈、闲话于一身，再加上剧中人物的喜怒哀乐和过渡时代的中国风貌，俨然成为了现代中国的一本伟大的小说。诺贝尔文学奖获得者赛珍珠评价此书说：“它实事求是，不为真实而羞愧。它写得美妙，既严肃又欢快，对古今中国都能给予正确的理解和评价。我认为这是迄今为止最真实、最深刻、最完备、最重要的一部关于中国的著作。”\n《京华烟云》是“林语堂三部曲”之一。本书献词为：“全书写罢泪涔涔，献予歼倭抗日人。不是英雄流热血，神州谁是自由民。” 可见，它是一部饱含深情地献给抗日英雄的巨著。林语堂先生说：“诚盼此书将给予吾人以深刻的启示，将我们深植于往昔的根蒂，开出灿丽的鲜花！” 那么，就让我们走进现代版“红楼梦”——《京华烟云》，去了解中国历史的变迁，去体会书中人物的悲欢离合，感受他们的酸甜苦辣……\n《京华烟云》",
            "《倾城之恋》是中国现代著名作家张爱玲创作的著名小说，也是她的成名作和经典代表作。《倾城之恋》讲述了一对现实中的庸俗男女在兵荒马乱的战争年代上演的一幕倾城之恋，叙述了一个动听而又近人情的爱情故事。此部作品是张爱玲最脍炙人口的文学著作之一，奠定了张爱玲在中国文坛上的重要地位。\n《倾城之恋》的爱情故事发生在香港。女主角白流苏原是上海的白家小姐，在经历过一次失败的婚姻后，身无分文的她备受亲戚们的冷嘲热讽。在她失望之余，从此变得冷漠，看尽世态炎凉。一次偶然的机会，她与男主人公范柳原——一个多金潇洒的单身汉结识，于是孤注一掷，远赴香港，追求范柳原的爱与婚姻。他们两个情场高手在浅水湾饭店斗智斗勇，最终白流苏服输了。但在日军开始轰炸浅水湾时，范柳原打消了离开的念头，回来保护白流苏。在生死攸关时，两人于“一刹那”间体会到了“一对平凡的夫妻”之间的“一点真心”，最后终于结婚了。但是婚姻并不能改变范柳原之前的生活习惯与作风，白流苏也只能睁只眼闭只眼……\n《倾城之恋》的作者张爱玲是中国现代最重要的作家，也是五四以来最优秀的作家。张爱玲原名张瑛，于1920年9月30日出生在上海公共租界西区。张爱玲家世显赫，童年时光却是黑暗的。她的生母流浪欧洲，她和弟弟是在后娘的监管下长大的，所以导致她的文学作品充满了悲观与势利。张爱玲一生创作了大量的文学作品，有小说、散文、电影剧本以及文学论著等，而她的经典代表作有《金锁记》、《倾城之恋》、《半生缘》和《红玫瑰与白玫瑰》等等。1995年09月08日，张爱玲于洛杉矶加州逝世，享年75岁。\n《倾城之恋》是张爱玲最为倾心的作品之一，张爱玲以独特的韵味和情致讲述了一对痴男怨女纠缠不清的爱情故事。著名作家王安忆说：“她有足够的情感能力去抵达深刻，可她没有勇敢承受这种能力所获得的结果，这结果太沉重，她是很知道这分量的。于是她便觉攫住自己，束缚在一些生活的可爱的细节，拼命去吸吮它的实在之处，以免自己再滑到虚无的边缘。”\n原本是一场自私而畸形的爱情交易，却因为战争，让两人相嚅以沫、生死相依。“别的她不知道，在这一刹那，她只有他，他也只有她……” 品读《倾城之恋》，看张爱玲如何看透人性、看透人生……\n《倾城之恋》",
            "《我们仨》是中国著名文学家钱钟书的夫人、中国著名作家杨绛女士撰写的一部家庭生活回忆录。我们仨指的是钱钟书先生、杨绛女士和他们唯一的女儿钱媛。作品记述了他们家庭三口63年来的风雨历程和生活中的点点滴滴。1997年，杨绛唯一的女儿钱媛离她而去；1998年，一生的伴侣丈夫钱钟书也与世长辞。杨绛女士痛失爱女与丈夫的四五年后，也即是其92岁高龄时，用心记录下了他们一家三口共同的生活记忆——那些快乐而艰难、爱与痛的日子。《我们仨》情感真挚饱满，情节感人肺腑，让人禁不住泪流满面……\n杨绛女士是中国著名的作家、翻译家、评论家和学者，原名杨季康，于1911年7月17日出生在北京，1932年毕业于苏州东吴大学，后与丈夫钱钟书一起到英国、法国留学，回国后在清华大学任教。新中国成立后，杨绛在中国社会科学院文学研究所、外国文学研究所工作。与其丈夫钱钟书一样，杨绛在中国文学界也拥有非常重要的地位。她的经典代表作有《洗澡》、《干校六记》等，剧本著作有《称心如意》、《弄真成假》、《风絮》等，译著有《堂吉诃德》、《吉尔·布拉斯》等。《我们仨》是杨绛女士于2003年发表的散文回忆录，记录了他们一家所经历的风风雨雨，颇为感人。\n《我们仨》分为两部分。第一部分讲述的是他们一家三口在最后几年中相依为命的情感体验，第二部分则记录了这个家庭自1935年夫妻二人赴英国留学到1998年钱钟书先生逝世的63年间鲜为人知的坎坷历程。杨绛女士以独特的写法，朴实感人的文字描述了他们一家所经历的战火、疾病、政治风暴和生离死别。无论是暴风抑或是骤雨，他们一家人相濡以沫；无论是酸甜还是苦辣，他们一家人共同品尝。美好的家庭已然是这一家人最安全的庇护所，也是人生最好的庇护所……\n天上人间，阴阳殊途，生离死别，杨绛女士晚年独伴青灯，用心灵、用文字，向逝去的亲人表达着最真挚的爱意和思念。那难以言表的亲情和忧伤弥漫在字里行间，令无数读者动容。\n“他已骨瘦如柴，我也老态龙钟。他没有力量说话，还强睁着眼睛招待我。我忽然想到第一次船上相会时，他问我还做梦不做。我这时明白了。我曾做过一个小梦，怪他一声不响地忽然走了。他现在故意慢慢儿走，让我一程一程送，尽量多聚聚，把一个小梦拉成一个万里长梦。这我愿意。送一程，说一声再见，又能见到一面。 离别拉得长，是增加痛苦还是减少痛苦呢？我算不清。但是我陪他走得愈远，愈怕从此不见。”\n“我一个人思念我们仨。” 这一句，就让我湿了眼角……\n《我们仨》",
            "《草房子》、《山羊不吃天堂草》、《细米》……这些拥有唯美名字的儿童文学作品，全部出自曹文轩老师之手。而《根鸟》，是曹文轩老师纯美浪漫小说系列中的又一部经典之作。《根鸟》叙述了一个名叫根鸟的少年梦幻而现实的身心成长史，是一部悠远而精彩的心灵童话。《根鸟》曾获第六届宋庆龄儿童文学奖一等奖和台湾“好书大家读”最佳少年儿童读物奖，赢得了所有孩子（包括小孩子和大孩子）的万般喜爱。\n《根鸟》中的少年根鸟梦见了一个美丽的少女，她在悬崖上采花，不慎掉进峡谷里。因为这个梦，根鸟从家乡菊坡出发了。他以梦为马，勇往直前，执着地踏上了未知的旅途，去寻找梦中开满百合花的大峡谷，营救那个叫做紫烟的女孩子。一路上，根鸟走过荒漠、草原、大山、村落、峡谷和小镇······他的旅程奇幻又玄妙，惊险又刺激。一路上困难重重，但他披荆斩棘，丝毫没有放弃。在这个旅程中，根鸟品尝了人生的喜怒哀乐，有过失落与迷茫，最后却仍然坚定、执着地寻找自己的梦想，直到梦想实现的那一刻。根鸟在现实与梦幻之间逐渐成长，在痛苦中收获快乐。\n曹文轩老师以唯美的文字描述了一个迷人的、浪漫的、梦幻般的故事。他让我们在梦幻中游走，却在真实中体验人生。他运用了一种童话般美丽、奇幻的写法，却写出了强烈的现实意义。根鸟在鬼谷那艰险的环境中从没想过将梦想放弃，却在幸福温暖的米溪把自己的梦想搁浅了几年，后来又在放纵、享乐的莺店差点把梦想丢失。不过还好，在曾经的旅伴板金的鼓励下，根鸟重新拾起了梦想，继续踏上了寻梦的旅途……\n其实，在每个人的人生旅程中，都会路过类似菊坡、鬼谷、米溪和莺店这样的地方。很多人不是没有梦想，而是梦想很快就在不知不觉中丢失了。也许丢在了安稳的菊坡，也许遗留在艰险的鬼谷，也许搁浅在安逸的米溪，又或许，堕落在放纵、享乐的莺店里。却很少人能够像根鸟一样，实现最初的那个梦想。曹老师笔下的《根鸟》，是一部虚幻而又具有浓重现实感的“成长小说”。在奇妙的故事场景和情节中，蕴涵着强烈的象征意义，让人们在阅读的同时也让各自的心灵洗了一个澡。\n曹老师自己评价《根鸟》时说：“意义必须是多面的。可以将它看成是一部情爱的启蒙小说，也可以将它看成是一部思考人生的小说，甚至可以将它看成是一部富有哲学意味的小说。” 读者不同，理解就不同，但是有一样是相同的，那就是我们都要坚定成长中的那个美丽而纯净的梦，以梦为马，勇往直前，去寻找我们心中开满百合花的大峡谷，去营救梦中那个叫紫烟的美丽女孩！\n《根鸟》",
            "《城南旧事》是中国著名女作家林海音创作的回忆记事小说。林海音以其六岁到十三岁的童年生活为背景，创作了这部自传体短篇小说集《城南旧事》，并于1960年初版。作品透过英子童稚的双眼，观看着大人世界里的悲欢离合、喜怒哀乐。书中那淡淡的哀愁与沉沉的相思，感染了一代又一代读者，使这部文学作品大获成功并经久不衰。以《城南旧事》改编而成的同名电影获得了“中国电影金鸡奖”等多项大奖，成为了中国当代电影中的经典作品。\n《城南旧事》的作者林海音原籍在台湾苗栗县头份镇， 原名林含英，小名英子，于1918年出生于日本大阪，3岁时随父母返回台湾，5岁来到北京，住在城南一座四合院里。林海音在北平度过了她的童年时光和青春岁月，在北平送走了自己英年早逝的父亲，在北平嫁为人妻。直到1948年，林海音带着妈妈、孩子和丈夫何凡举家返回台湾。林海音对自己成长的北京古城具有很深的感情，于是创作出了经典代表作《城南旧事》，以纪念自己童年的似水流年。\n在二十世纪二十年代的北平城南的一座四合院里，住着英子温暖和睦的一家。林海音以温婉的文笔、超逸的风格，从天真善良的英子的角度描写出了古城北京形形色色的人和事，道尽了人世间复杂的情感，展现了旧北京的社会风貌。看着大人们的美好愿望总是与社会现实存在着巨大的反差，英子童真弱小的心灵也越发显得孱弱。《城南旧事》字里行间都缠绕着悲剧色彩，让文章显得丰富厚重，令人触目，发人深省。\n充满自然、怀旧基调的《城南旧事》曾被评为亚洲周刊 “二十世纪中文小说一百强”，是《百年百部中国儿童文学经典书系》之一。文中那淡淡的忧伤、浓浓的诗意，让一代又一代人深受感染。《城南旧事》通过看似狭小的故事描写，反映了当时北京的整个历史面貌，有着极强的社会意义，不愧是林海音独步文坛多年的经典文学作品。\n“长亭外，古道边，芳草碧连天。晚风拂柳笛声残，夕阳山外山。天之涯，地之角，知交半零落。一瓢浊酒尽余欢，今宵别梦寒。” 《城南旧事》是一部安静的小说，一部关于成长的寓言。当英子爸爸的花儿落下的时候，她已不再是小孩子……童年就这样远去，因为，这就是成长……\n《城南旧事》"};
    private static String[] online=new String[]{"京东商城:http://item.jd.com/11174489.html 当当网:http://product.dangdang.com/product.aspx?product_id=23181422",
            "京东商城:http://item.jd.com/10706808.html 当当网:http://product.dangdang.com/product.aspx?product_id=21127783",
            "京东商城:http://book.jd.com/11014800.html 当当网:http://product.dangdang.com/product.aspx?product_id=22554517",
            "京东商城:http://book.jd.com/11139510.html",
            "京东商城:http://book.jd.com/10862584.html 当当网:http://product.dangdang.com/product.aspx?product_id=22553275",
            "京东商城:http://book.360buy.com/11020132.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22782677",
            "京东商城:http://book.360buy.com/11096744.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22660863",
            "京东商城:http://book.360buy.com/10016640.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22506351}",
            "京东商城:http://book.360buy.com/10037872.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22606942"};
    public static ArrayList<BookDetailData> bookDetailDatas=new ArrayList<BookDetailData>();
    public static void initBookDetailDatas(){
        for(int i=0;i<9;i++){
            BookDetailData bookDetailData=new BookDetailData();
            bookDetailData.setTitle(bookNames[i]);
            bookDetailData.setTags(tags[i]);
            bookDetailData.setReading(reading[i]);
            bookDetailData.setSub2(brief[i]);
            bookDetailData.setOnline(online[i]);
            bookDetailDatas.add(bookDetailData);
        }
    }
}

